google-coral/coralmicro-rt1176-sdk/middleware/wiced/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/libraries/drivers/peripheral/sdio/SDIO_HOST_Resp_DMA.h
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetInterruptStatus(void);
__STATIC_INLINE void     SDIO_HOST_Resp_DMA_ClearInterrupt(void);
__STATIC_INLINE void     SDIO_HOST_Resp_DMA_SetInterrupt(void);
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetInterruptMask(void);
__STATIC_INLINE void     SDIO_HOST_Resp_DMA_SetInterruptMask(uint32_t interrupt);
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetInterruptStatusMasked(void);


/***************************************
*    Global Variables
***************************************/
extern uint8_t SDIO_HOST_Resp_DMA_initVar;

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Resp_DMA_Resp_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Resp_DMA_Resp_DMA_Desc;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_Stop(void)
{
    Cy_DMA_Channel_Disable(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * SDIO_HOST_Resp_DMA_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * SDIO_HOST_Resp_DMA_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


