google-coral/coralmicro-rt1176-sdk/middleware/wiced/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/libraries/drivers/peripheral/sdio/SDIO_HOST_Resp_DMA.h
/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetInterruptStatus()
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptStatus() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetInterruptStatus(void)
{
    return (Cy_DMA_Channel_GetInterruptStatus(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetStatus
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetStatus() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_en_dma_intr_cause_t SDIO_HOST_Resp_DMA_GetStatus(void)
{
    return (Cy_DMA_Channel_GetStatus(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_ClearInterrupt
****************************************************************************//**
* Invokes the Cy_DMA_Channel_ClearInterrupt() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_ClearInterrupt(void)
{
    Cy_DMA_Channel_ClearInterrupt(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetInterrupt
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetInterrupt() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetInterrupt(void)
{
    Cy_DMA_Channel_SetInterrupt(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetInterruptMask(void)
{
    return (Cy_DMA_Channel_GetInterruptMask(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetInterruptMask(uint32_t interrupt)
{
    Cy_DMA_Channel_SetInterruptMask(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL, interrupt);
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_GetInterruptStatusMasked
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptStatusMasked() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetInterruptStatusMasked(void)
{
    return (Cy_DMA_Channel_GetInterruptStatusMasked(SDIO_HOST_Resp_DMA_HW, SDIO_HOST_Resp_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_Trigger
****************************************************************************//**
*
* Invokes the Cy_TrigMux_SwTrigger() PDL driver function.
*
* \param cycles
*  The number of "PeriClk" cycles during which the trigger remains activated.
*  The valid range of cycles is 1 ... 254.
*  Also there are special values:
*  CY_TRIGGER_INFINITE - trigger remains activated untill user deactivates it by
*  calling this function with CY_TRIGGER_DEACTIVATE parameter.
*  CY_TRIGGER_DEACTIVATE - it is used to deactivate the trigger activated by
*  calling this function with CY_TRIGGER_INFINITE parameter.
*
* \return A status:
* - CY_TRIGMUX_SUCCESS: The trigger is succesfully activated/deactivated.
* - CY_TRIGMUX_INVALID_STATE: The trigger is already activated/not active.
*
*******************************************************************************/
__STATIC_INLINE cy_en_trigmux_status_t SDIO_HOST_Resp_DMA_Trigger(uint32_t cycles)
{
    return (Cy_TrigMux_SwTrigger((uint32_t)SDIO_HOST_Resp_DMA_DW__TR_IN, cycles));
}


#if(CY_DMA_BWC)
/* Definitions to support backward compatibility with the component version 1.0,
*  they are strongly not recommended to use in new designs */

#define SDIO_HOST_Resp_DMA_ChEnable                (SDIO_HOST_Resp_DMA_ChannelEnable)
#define SDIO_HOST_Resp_DMA_ChDisable               (SDIO_HOST_Resp_DMA_ChannelDisable)
#define SDIO_HOST_Resp_DMA_SetDataElementSize      (SDIO_HOST_Resp_DMA_SetDataSize)
#define SDIO_HOST_Resp_DMA_GetDataElementSize      (SDIO_HOST_Resp_DMA_GetDataSize)
#define SDIO_HOST_Resp_DMA_SetXloopNumDataElements (SDIO_HOST_Resp_DMA_SetXloopDataCount)
#define SDIO_HOST_Resp_DMA_GetXloopNumDataElements (SDIO_HOST_Resp_DMA_GetXloopDataCount)
#define SDIO_HOST_Resp_DMA_SetYloopNumDataElements (SDIO_HOST_Resp_DMA_SetYloopDataCount)
#define SDIO_HOST_Resp_DMA_GetYloopNumDataElements (SDIO_HOST_Resp_DMA_GetYloopDataCount)
#define SDIO_HOST_Resp_DMA_SetInterruptMask()      (SDIO_HOST_Resp_DMA_SetInterruptMask(SDIO_HOST_Resp_DMA_INTR_MASK))
#define SDIO_HOST_Resp_DMA_GetInterruptCause       (SDIO_HOST_Resp_DMA_GetStatus)

#define SDIO_HOST_Resp_DMA_PREEMTAMBLE             (SDIO_HOST_Resp_DMA_PREEMPTABLE)
/*******************************************************************************
* Function Name: SDIO_HOST_Resp_DMA_SetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE void SDIO_HOST_Resp_DMA_SetSrcDstTransferWidth(cy_stc_dma_descriptor_t * descriptor, uint32_t options)
{
    uint32_t ctlRegVal = descriptor->ctl & ((uint32_t)~(DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | \
            DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));

    descriptor->ctl = ctlRegVal |
        ((options << DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos) &
        (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
}


/*******************************************************************************
* Function Name: DMA_1_GetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE uint32_t SDIO_HOST_Resp_DMA_GetSrcDstTransferWidth(cy_stc_dma_descriptor_t const * descriptor)
{
    uint32_t ctlRegVal = descriptor->ctl & (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk |
        DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk);

    return(ctlRegVal >> DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos);
}

#endif /* CY_DMA_BWC */


#if defined(__cplusplus)
}
#endif

#endif/* (SDIO_HOST_Resp_DMA_CH_H) */

/* [] END OF FILE */
